In [1]:
#Importing pandas library
import pandas as pd

There are 2 datastrctures in pandas.
1. Series: It is a 1D array, with a single column only.
2. Dataframes: It will be 2D and has more than one column.

In [3]:
# Creating a series: Index is autocreated, 
data = pd.Series([10, 20, 30, 40, 50, 60, 70, 80], name = "marks", index = [1, 2, 3, 4, 4, 6, 7, 8])
# head is used to read the first 5 rows, tail is used to read last 5 rows
print(data.head())

1    10
2    20
3    30
4    40
4    50
Name: marks, dtype: int64

In [4]:
import re
print(re.findall(r'\bact', 'scatter cat category'))

[]

In [ ]:
# reading csv file, will be converted to a dataframe
std_df = pd.read_csv("data/student.csv")
std_df.head()

In [ ]:
# reading one column
ages = std_df["age"]
print(ages)

In [ ]:
# creating dataframe using dictionary
data = {
    "name": ["Arun", "John", "Meera"],
    "age": [21, 22, 23],
    "marks": [85, 90, 95]
}

df = pd.DataFrame(data)
print(df.head())

In [ ]:
#print(df["marks"]) #reading single column
#print(df[["name", "marks"]]) #reading multiple column
#print(df.iloc[0]) #reading first row using iloc 
#print(df.iloc[0:2]) #reading multiple rows using iloc
#print(df.loc[0, "name"]) #reading specific row and column using loc

In [ ]:
# filtering the people who has >= 90 marks
df.loc[df["marks"] >= 90]

In [ ]:
# same as above
df[df["marks"] >= 90]

In [ ]:
# filtering the people who's age is less than 22
df[df["age"] < 22]

In [ ]:
# creating a new column, storing result of condition >= 90 marks
df["res"] = df["marks"] >= 90

In [ ]:
df.head()

In [ ]:
# creating a new column to make age group, by storing result of apply function to implement a function
# a lambda function is similar to an udf, which can take multiple arguments but single statement.
df["age_group"] = df["age"].\
    apply(lambda x: "Adult" if x > 19 else "Teen")

In [ ]:
df.head()

In [ ]:
# creating 2 dataframes
students = pd.DataFrame({
    "id": [1, 2, 3],
    "name": ["Arun", "John", "Meera"]
})

marks = pd.DataFrame({
    "id": [1, 2, 3, 4],
    "marks": [85, 90, 95, 100]
})

#performing merging with inner join based on id column

merged = pd.merge(students, marks, on = "id", how = "inner")
print(merged.head())

1. Left-top: Inner

2. Right-top: Right

3. Left-bottom: Left

4. Right-bottom: Full
![joins.png](media/joins.png)

Note: While merge works on columns, join in pandas joins dataframes based on index.

In [31]:
import pandas as pd

# creating a dataframe for sales data

df = pd.DataFrame({
    "city": ["Tashkent", "Tashkent", "Bukhara", "Bukhara"],
    "sales": [100, 150, 120, 130]
})

print(df.head())

       city  sales
0  Tashkent    100
1  Tashkent    150
2   Bukhara    120
3   Bukhara    130

In [34]:
# groupby city to find total sales of each city
df.groupby("city")["sales"].sum()

city
Bukhara     250
Tashkent    250
Name: sales, dtype: int64

In [35]:
df.groupby("city")["sales"].mean()

city
Bukhara     125.0
Tashkent    125.0
Name: sales, dtype: float64

In [36]:
# groupby city to find sum, average, max, and min of sales
df.groupby("city")["sales"].agg(["sum", "mean", "max", "min"])

          sum   mean  max  min
city
Bukhara   250  125.0  130  120
Tashkent  250  125.0  150  100

In [37]:
# finding 5 point summary, count, mean, and standard deviation of the dataframe
df.describe()

           sales
count    4.00000
mean   125.00000
std     20.81666
min    100.00000
25%    115.00000
50%    125.00000
75%    135.00000
max    150.00000

In [ ]:
# reading a csv file, to create a dataframe
sales_df = pd.read_csv("data/sales.csv")
sales_df.head()

        city product  sales
0  Bengaluru       A  100.0
1  Bengaluru       B    NaN
2    Chennai       A  120.0
3    Chennai       B  130.0

In [39]:
# checking if there are NaN/ None values
# True -> NaN/ None value
sales_df.isna() #sales_df.isnull()

    city  product  sales
0  False    False  False
1  False    False   True
2  False    False  False
3  False    False  False

In [40]:
# counting NaN/ None values in each column
sales_df.isna().sum()

city       0
product    0
sales      1
dtype: int64

#### find the median
10, 50, 40, 60, 20, 30
10, 20, [30 + 40] / 2, 50, 60

In [41]:
# filling the None value in sales column with the median of that column.
# inplace = True will store the result into the the original dataframe
sales_df["sales"].fillna(df["sales"].median(), inplace = True)

C:\Users\User\AppData\Local\Temp\ipykernel_24616\2586152335.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  sales_df["sales"].fillna(df["sales"].median(), inplace = True)

In [42]:
sales_df.fillna({"sales": df["sales"].median()}, inplace = True)

In [43]:
sales_df.head()

        city product  sales
0  Bengaluru       A  100.0
1  Bengaluru       B  125.0
2    Chennai       A  120.0
3    Chennai       B  130.0

In [ ]:
# sorting the dataframe in descending order
#std_df.head()
std_df = pd.read_csv("data/student.csv")
#std_df.sort_values("marks", ascending = False)

sales_df.sort_values("sales")

        city product  sales
0  Bengaluru       A  100.0
2    Chennai       A  120.0
1  Bengaluru       B  125.0
3    Chennai       B  130.0

In [ ]:
# loading (saving) the dataframe back to a csv file
std_df.to_csv("data/new.csv")

In [ ]:
sales_df.to_csv("data/sales2.csv")